In [3]:
# create dataframe with pandas
dic = {"pizza_name":["Hawaii","Diablo","Pepperoni","Hawaii","Diablo","Pepperoni"],"company_name":["A","A","A","B","B","B"],"price":[5,7,9,8,12,14],"sale_2020":[1000,700,1400,800,300,600]}

In [4]:
import pandas as pd
df = pd.DataFrame(dic)

In [3]:
df

  pizza_name company_name  price  sale_2020
0     Hawaii            A      5       1000
1     Diablo            A      7        700
2  Pepperoni            A      9       1400
3     Hawaii            B      8        800
4     Diablo            B     12        300
5  Pepperoni            B     14        600

In [1]:
#or create csv file with csv module and read it with pandas into DataFrame
import csv
with open("pizza",mode = "w") as f:
    fw = csv.writer(f,delimiter = ",")
    fw.writerow(["pizza_name","company_name","price","sale_2020"])
    fw.writerow(["Hawaii","A","5","1000"])
    fw.writerow(["Diablo","A","7","700"])
    fw.writerow(["Peppereni","A","9","1400"])
    fw.writerow(["Hawaii","B","8","800"])
    fw.writerow(["Diablo","B","12","300"])
    fw.writerow(["Pepperoni","B","14","600"])

In [5]:
dfr = pd.read_csv("pizza")

In [6]:
dfr

  pizza_name company_name  price  sale_2020
0     Hawaii            A      5       1000
1     Diablo            A      7        700
2  Peppereni            A      9       1400
3     Hawaii            B      8        800
4     Diablo            B     12        300
5  Pepperoni            B     14        600